[
	{
		"id": "ps",
		"title": "Products and strategy portfolio",
		"date": "Summer 2019",
		"credits": "Created at RBC Wealth Management",
		"description": "The Products and Strategy team was a team within RBC Wealth Management focused on creating digital products from start to finish. They mainly focused on design, development, analytics, and product management. This is a portfolio website showcasing some of the Product and Strategy team's capabilities and works.",
		"highlights": [
			"Worked closely with designers to create unique designs, animations and interactions through Zeplin mockups and mov file concepts.",
			"Collaborated with another developer to integrate pages and content into Nuxt.",
			"Built custom responsive layouts using CSS grid and created a custom theme for the overall website look and feel.",
			"Created animations for page transitions, loading states, interactions, etc. using Vue transitions or CSS only."
		],
		"images": [
			{
				"src": "/img/ps-01.webp",
				"alt": "Full page screenshot of Products and Strategy home page",
				"height": 3634,
				"width": 896
			},
			{
				"src": "/img/ps-02.webm",
				"alt": "Products and Strategy ampersand loading animation",
				"placeholder": "/img/ps-02-placeholder.webp"
			},
			{
				"src": "/img/ps-05.webm",
				"alt": "Products and Strategy website block featuring ampersand mask with animating web of lines",
				"placeholder": "/img/ps-05-placeholder.webp"
			},
			{
				"src": "/img/ps-03.webm",
				"alt": "Products and Strategy website work page highlighting subtle animations",
				"placeholder": "/img/ps-03-placeholder.webp"
			},
			{
				"src": "/img/ps-04.webm",
				"alt": "Products and Strategy website page transitions",
				"placeholder": "/img/ps-04-placeholder.webp"
			}
		],
		"imageFeatureIndex": 0,
		"repo": "",
		"skills": [
			"html",
			"css",
			"vue",
			"nuxt",
			"animation",
			"svg"
		],
		"url": ""
	},
	{
		"id": "rbcwm",
		"title": "RBC Wealth Management website",
		"date": "Autumn 2022",
		"credits": "Created at RBC Wealth Management",
		"description": "The RBC Wealth Management public facing website is used for driving high-net worth client leads and displaying information about offered services. The website was built off of the Wealth Management Design System, extending its styles to create a new look and feel. This website features several subtle motion interactions to give keep an overall upscale appearance. The content on this website is powered through a powerful enterprise CMS.",
		"highlights": [
			"Collaborated from the project inception with an external vendors who were responsible for creating designs in Figma and integrating front end with the CMS.",
			"Created a full custom theme within the RBC Wealth Management Design System styles and components using Vue.js, which included custom components and directives.",
			"Built the prototypes and base for the front end widgets to be implemented into the CMS.",
			"Built custom interactive elements and animations using technologies such as SVG, Vue.js, etc.",
			"Created scroll and parallax style animations using the IntersectionObserver API and custom Vue directives.",
			"Worked with backend developers to learn and integrate new widgets, features, and capabilities into an enterprise CMS.",
			"Worked with designers to ensure designs met accessibility, brand and design system requirements.",
			"Built mini applications using Vue.js within the website such as the contact form, advisor search, etc."
		],
		"images": [
			{
				"src": "/img/rbcwm-01.webp",
				"alt": "Full page screenshot of RBC Wealth Management home page",
				"height": 4213,
				"width": 896
			},
			{
				"src": "/img/rbcwm-02.webm",
				"alt": "RBC Wealth Management website block featuring animated spinning wheel interaction",
				"placeholder": "/img/rbcwm-02-placeholder.webp"
			},
			{
				"src": "/img/rbcwm-03.webm",
				"alt": "RBC Wealth Management website About us page with scroll interactions including a timeline",
				"placeholder": "/img/rbcwm-03-placeholder.webp"
			},
			{
				"src": "/img/rbcwm-04.webm",
				"alt": "RBC Wealth Management website Royal Trust landing page showing scrolling, interactive navigation",
				"placeholder": "/img/rbcwm-04-placeholder.webp"
			},
			{
				"src": "/img/rbcwm-05.webm",
				"alt": "RBC Wealth Management website campaign page with interactive infographics and quiz blocks",
				"placeholder": "/img/rbcwm-05-placeholder.webp"
			}
		],
		"imageFeatureIndex": 0,
		"repo": "",
		"skills": [
			"html",
			"css",
			"vue",
			"design system",
			"cms"
		],
		"url": "https://rbcwm.com"
	},
	{
		"id": "rbcwmds",
		"title": "RBC Wealth Management design system",
		"credits": "Created at RBC Wealth Management",
		"date": "Ongoing 2018",
		"description": "The RBC Wealth Management digital team built a design system originally created and used to help simplify the design and engineering team's work. The library features a vast array of components tailored to a Wealth Management user built using the Vue.js and Angular frameworks. It is built to be theme-able and has been adopted and themed by various other brands within the Wealth Management business.",
		"highlights": [
			"Collaborated with another developer to fully build and style an entire library of Vue.js components.",
			"Worked with design to implement initial Zeplin mockups, which provided the base styles, component mock ups, element states, responsive views, etc.",
			"Helped ideate and implement user interactions and animations with little guidance from design.",
			"Collaborated with other developers to write end-to-end tests using Cypress for all components to be shared across all JS frameworks.",
			"Ensured the components meet accessibility standards and guidelines by using axe-core plugins and browser extensions, completing keyboard navigation and screen reader testing, etc.",
			"Helped build and write content as well as continuously update documentation site using Nuxt.",
			"Maintained Vue.js and Sass library, ensuring packages were kept up to date and bugs addressed.",
			"Contributed to Angular and React versions of the component library.",
			"Worked with product, design, and development to create business strategies and vision planning.",
			"Provided direct support to developers from across the organization to fix bugs, add new features or components, address or aid with usage issues, gather feedback, etc.",
			"Upgraded Vue component library to 2 to 3, which included adding Typescript and updating from the options API to the composition API."
		],
		"images": [
			{
				"src": "/img/rbcwmds-01.webp",
				"alt": "Full page screenshot of RBC Wealth Management Design System landing page",
				"height": 717,
				"width": 896
			},
			{
				"src": "/img/rbcwmds-05.webp",
				"alt": "Full page screenshot of RBC Wealth Management Design System colours page",
				"height": 828,
				"width": 896
			},
			{
				"src": "/img/rbcwmds-06.webp",
				"alt": "Full page screenshot of RBC Wealth Management Design System Button component page",
				"height": 2258,
				"width": 896
			},
			{
				"src": "/img/rbcwmds-02.webm",
				"alt": "RBC Wealth Management Design System landing page interactions and animation",
				"placeholder": "/img/rbcwmds-02-placeholder.webp"
			},
			{
				"src": "/img/rbcwmds-03.webm",
				"alt": "RBC Wealth Management Design System Tab component page interactions",
				"placeholder": "/img/rbcwmds-03-placeholder.webp"
			},
			{
				"src": "/img/rbcwmds-04.webm",
				"alt": "RBC Wealth Management Design System Timepicker component page interactions",
				"placeholder": "/img/rbcwmds-04-placeholder.webp"
			}
		],
		"imageFeatureIndex": 0,
		"repo": "",
		"skills": [
			"html",
			"css",
			"vue",
			"design system"
		],
		"url": ""
	},
	{
		"id": "critterpedia",
		"title": "Critterpedia",
		"date": "Summer 2020",
		"description": "Animal Crossing is a game that I have played since 2012. Something I found useful in my own playthrough was a way to quickly reference the wildlife to be caught in-game. There wasn't one that fit my needs at the time, so I built an encyclopedia reference of fish and bugs that can be found within the game. This application helps users determine which creatures are currently available in the game depending on the month and time using dynamic and searchable data compiled before there were available APIs.",
		"highlights": [
			"Designed and tailored layout and UI for easy access to necessary information while playing the game.",
			"Created custom SVG icons for navigation, background, and UI elements.",
			"Built interface using Vue.js to handle the main app functionality and routing."
		],
		"images": [
			{
				"src": "/img/cp-01.webp",
				"alt": "Full page screenshot of Critterpedia Fish listing page",
				"height": 1065,
				"width": 896
			},
			{
				"src": "/img/cp-02.webm",
				"alt": "Critterpedia toggling between Bugs and Fish pages",
				"placeholder": "/img/cp-02-placeholder.webp"
			},
			{
				"src": "/img/cp-03.webm",
				"alt": "Critterpedia filtering bugs based on location and month",
				"placeholder": "/img/cp-03-placeholder.webp"
			}
		],
		"imageFeatureIndex": 0,
		"repo": "https://github.com/tiffachoo/critterpedia",
		"skills": [
			"html",
			"css",
			"vue",
			"svg",
			"design"
		],
		"url": "https://tiff-critterpedia.netlify.app/#/bugs"
	},
	{
		"id": "codepen",
		"title": "Codepen pens",
		"date": "Ongoing, spring 2018",
		"description": "Codepen is a sandbox for web developers to play in, and that is where I have my fun! This is a collection of web experiments, animated SVGs, and CSS art placed on Codepen because it's fun and personal to me. All SVG and CSS art is original art or fan art.",
		"highlights": [
			"Designed, illustrated, and animated original art using CSS only or SVGs created in Adobe Illustrator.",
			"Designed and built custom web interfaces to practice skills and experiment with new technologies and features."
		],
		"images": [
			{
				"src": "/img/codepen-01.webp",
				"alt": "Codepen profile page featured pens",
				"height": 1242,
				"width": 896
			},
			{
				"src": "/img/codepen-02.gif",
				"alt": "Codepen animated Kirby email input where Kirby inhales the user's email on submit",
				"height": 435,
				"width": 896
			},
			{
				"src": "/img/codepen-03.gif",
				"alt": "Codepen Who's that Pokemon guessing game",
				"height": 435,
				"width": 896
			},
			{
				"src": "/img/codepen-04.gif",
				"alt": "Codepen animated Tiger CSS art that flips to its back side",
				"height": 436,
				"width": 896
			},
			{
				"src": "/img/codepen-05.gif",
				"alt": "Codepen Pokemon stats page featuring matching themes for Eevee and its evolutions",
				"height": 435,
				"width": 896
			},
			{
				"src": "/img/codepen-06.gif",
				"alt": "Codepen animated Aggretsuko CSS art where she is initially dancing then is enraged when interacted with",
				"height": 435,
				"width": 896
			}
		],
		"imageFeatureIndex": 0,
		"repo": "",
		"skills": [
			"html",
			"css",
			"vue",
			"svg",
			"animation",
			"design"
		],
		"url": "https://codepen.io/tiffachoo"
	}
]